In [1]:
import pymysql
import pandas as pd

In [2]:
_db = pymysql.connect(
    user = "root",
    passwd = "1234",
    host = "localhost",
    db = "ubion"
)

In [3]:
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [16]:
sql = "SELECT * FROM user_info"

cursor.execute(sql)
result = cursor.fetchall()
print(result)

[{'ID': 'test', 'password': '1234', 'name': '고길동', 'phone': '01012345678', 'ads': '서울시 강북구 쌍문동', 'gender': 1, 'age': 45, 'regit_date': '20220310'}, {'ID': 'test2', 'password': '5678', 'name': '둘리', 'phone': '01098765432', 'ads': '북극 어딘가', 'gender': 1, 'age': 10, 'regit_date': '20220310'}, {'ID': 'test3', 'password': '8513', 'name': '마이콜', 'phone': '01048426489', 'ads': '고길동 옆 집', 'gender': 1, 'age': 28, 'regit_date': '20220310'}, {'ID': 'test4', 'password': '4521', 'name': '또치', 'phone': '01051247856', 'ads': '동물원', 'gender': 2, 'age': 4, 'regit_date': '20200310'}, {'ID': 'test5', 'password': '5555', 'name': '도우너', 'phone': '01012345678', 'ads': '깐따삐아', 'gender': 1, 'age': 10, 'regit_date': '20220310'}]

In [17]:
# result를 데이터프레임으로 만들어봅시다!!!
# 변수명 dt로 
dt = pd.DataFrame(result)
dt

      ID password name        phone          ads  gender  age regit_date
0   test     1234  고길동  01012345678  서울시 강북구 쌍문동       1   45   20220310
1  test2     5678   둘리  01098765432       북극 어딘가       1   10   20220310
2  test3     8513  마이콜  01048426489      고길동 옆 집       1   28   20220310
3  test4     4521   또치  01051247856          동물원       2    4   20200310
4  test5     5555  도우너  01012345678         깐따삐아       1   10   20220310

In [18]:
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s)"
values = ["test4", "4521", "또치", "01051247856", "동물원", 2, 4, "20200310"]

cursor.execute(sql, values)
_db.commit()

In [31]:
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s)"

x = input("ID : ")
pw = input("password : ")
name = input("name : ")
phone = input("phone : ")
ads = input("address : ")
gender = int(input("gender : "))
age = int(input("age : "))
regit_date = input("regit_date : ")

input_list = [x, pw, name, phone, ads, gender, age, regit_date]
print(input_list)
print(type(input_list))

cursor.execute(sql, input_list)
_db.commit()

['test5', '5555', '도우너', '01055551111', '깐따삐아', 1, 10, '20220310']
<class 'list'>

In [33]:
x = int(input("x : "))

type(x)

int

In [8]:
update_sql =""" 
                UPDATE user_info 
                SET phone = "01012345678"
                WHERE name = "도우너"
            """
cursor.execute(update_sql)
_db.commit()

In [15]:
delete_sql ="""
            DELETE FROM user_info 
            WHERE ID = "1"
            """
cursor.execute(delete_sql)
_db.commit()